philips-software/amp-hal-st/st/CMSIS_STM32H5xx/ARM.CMSIS.pdsc
    <!-- CMSIS DSP -->
    <condition id="CMSIS DSP">
      <description>Components required for DSP</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- CMSIS NN -->
    <condition id="CMSIS NN">
      <description>Components required for NN</description>
      <require Cclass="CMSIS" Cgroup="DSP"/>
    </condition>

    <!-- RTOS RTX -->
    <condition id="RTOS RTX">
      <description>Components required for RTOS RTX</description>
      <require condition="ARMv6_7-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <deny    Cclass="CMSIS"  Cgroup="RTOS2" Csub="Keil RTX5"/>
    </condition>
    <condition id="RTOS RTX IFX">
      <description>Components required for RTOS RTX IFX</description>
      <require condition="ARMv6_7-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Dvendor="Infineon:7" Dname="XMC4*"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <deny    Cclass="CMSIS"  Cgroup="RTOS2" Csub="Keil RTX5"/>
    </condition>
    <condition id="RTOS RTX5">
      <description>Components required for RTOS RTX5</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="RTOS2" Csub="Keil RTX5"/>
    </condition>
    <condition id="RTOS2 RTX5">
      <description>Components required for RTOS2 RTX5</description>
      <require condition="ARMv6_7_8-M Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="RTOS2 RTX5 v7-A">
      <description>Components required for RTOS2 RTX5 on Armv7-A</description>
      <require condition="ARMv7-A Device"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="OS Tick"/>
      <require Cclass="Device" Cgroup="IRQ Controller"/>
    </condition>
    <condition id="RTOS2 RTX5 NS">
      <description>Components required for RTOS2 RTX5 in Non-Secure Domain</description>
      <require condition="ARMv8-M Device"/>
      <require condition="TZ Non-secure"/>
      <require condition="ARMCC GCC IAR"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>

    <condition id="ARMCC ARMv6-M LE">
        <description>Arm Compiler for Armv6-M architecture (little endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv6-M Device"/>
        <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMCC ARMv6-M BE">
        <description>Arm Compiler for Armv6-M architecture (big endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv6-M Device"/>
        <require Dendian="Big-endian"/>
    </condition>
    <condition id="ARMCC ARMv7-M NOFP LE">
        <description>Arm Compiler for Armv7-M architecture without FPU (little endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="ARMCC ARMv7-M NOFP BE">
        <description>Arm Compiler for Armv7-M architecture without FPU (big endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Big-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="ARMCC ARMv7-M FP LE">
        <description>Arm Compiler for Armv7-M architecture with FPU (little endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
    <condition id="ARMCC ARMv7-M FP BE">
        <description>Arm Compiler for Armv7-M architecture with FPU (big endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Big-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
    <condition id="ARMCC ARMv8-MBL LE">
        <description>Arm Compiler for Armv8-M base line architecture (little endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv8-MBL Device"/>
        <require Dendian="Little-endian"/>
    </condition>
    <condition id="ARMCC ARMv8-MML NOFP LE">
        <description>Arm Compiler for Armv8-M/Armv8.1-M main line architecture without FPU/MVE (little endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv8x-MML Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
        <require Dmve="NO_MVE"/>
    </condition>
     <condition id="ARMCC ARMv8-MML FP LE">
        <description>Arm Compiler for Armv8-M/Armv8.1-M main line architecture with FPU/MVE (little endian)</description>
        <require condition="ARMCC"/>
        <require condition="ARMv8x-MML Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
        <accept Dmve="MVE"/>
        <accept Dmve="FP_MVE"/>
    </condition>

    <condition id="GCC ARMv6-M LE">
        <description>GNU Compiler for Armv6-M architecture (little endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv6-M Device"/>
        <require Dendian="Little-endian"/>
    </condition>
    <condition id="GCC ARMv6-M BE">
        <description>GNU Compiler for Armv6-M architecture (big endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv6-M Device"/>
        <require Dendian="Big-endian"/>
    </condition>
    <condition id="GCC ARMv7-M NOFP LE">
        <description>GNU Compiler for Armv7-M architecture without FPU (little endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Little-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="GCC ARMv7-M NOFP BE">
        <description>GNU Compiler for Armv7-M architecture without FPU (big endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Big-endian"/>
        <require Dfpu="NO_FPU"/>
    </condition>
    <condition id="GCC ARMv7-M FP LE">
        <description>GNU Compiler for Armv7-M architecture with FPU (little endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Little-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
    <condition id="GCC ARMv7-M FP BE">
        <description>GNU Compiler for Armv7-M architecture with FPU (big endian)</description>
        <require condition="GCC"/>
        <require condition="ARMv7-M Device"/>
        <require Dendian="Big-endian"/>
        <accept Dfpu="SP_FPU"/>
        <accept Dfpu="DP_FPU"/>
    </condition>
